Config/Catalogs/ГосударственныеОборонныеЗаказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГосударственныеОборонныеЗаказы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловнойИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УполномоченныйБанк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/ТипыЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЛицевыхСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Казначейский</Name>
					<Comment>Лицевой счет открыт в органе казначейства или финансовом органе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банковский</Name>
					<Comment>Счет открыт в учреждении банка, кредитной организации или на едином казначейском счете</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ГосударственныеОборонныеЗаказы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ТипЛицевогоСчета) Тогда
			Объект.ТипЛицевогоСчета = ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Банковский");
		КонецЕсли;
	КонецЕсли;
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
	УстановитьВидимостьЭлементовФормы(Элементы, СокрЛП(Объект.Код));
	
	УправлениеЭлементамиФормы();
	
	УстановитьПараметрыРеквизитовПоТипуСчета();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовФормы(Элементы, СокрЛП(Объект.Код));
	
	Если СтрДлина(СокрЛП(Объект.Код)) = 25 Тогда
		УправлениеЭлементамиФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЛицевогоСчетаПриИзменении(Элемент)
	УстановитьПараметрыРеквизитовПоТипуСчета();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	ГодЗаключения = "20" + Сред(Объект.Код, 1, 2);
	ГодОкончания = "20" + Сред(Объект.Код, 3, 2);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ГлавыПоБюджетнойКлассификации.НаименованиеПолное КАК НаименованиеПолное
	|ИЗ
	|	Справочник.ГлавыПоБюджетнойКлассификации КАК ГлавыПоБюджетнойКлассификации
	|ГДЕ
	|	ГлавыПоБюджетнойКлассификации.Код = &Код";
	Запрос.УстановитьПараметр("Код",Сред(Объект.Код, 5, 3));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ГосЗаказчик = СокрЛП(Выборка.НаименованиеПолное);
	Иначе
		ГосЗаказчик = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыРеквизитовПоТипуСчета()
	
	ЭтоБанковскийСчет = Объект.ТипЛицевогоСчета = ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Банковский");
	Если ЭтоБанковскийСчет Тогда
		ТипКассовогоОргана = Новый ОписаниеТипов("СправочникСсылка.Банки");
		ЗаголовокКассовогоОргана = "Уполномоченный банк";
	Иначе
		ТипКассовогоОргана = Новый ОписаниеТипов("СправочникСсылка.Казначейства");
		ЗаголовокКассовогоОргана = "Казначейство";
	КонецЕсли;
	
	Элементы.УполномоченныйБанк.ОграничениеТипа = ТипКассовогоОргана;
	Элементы.УполномоченныйБанк.Заголовок = ЗаголовокКассовогоОргана;
	
	Объект.УполномоченныйБанк = Элементы.УполномоченныйБанк.ОграничениеТипа.ПривестиЗначение(Объект.УполномоченныйБанк);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы(Элементы, Идентификатор)
	
	ВидимостьВспомогательныхРеквизитов = СтрДлина(Идентификатор) = 25;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГодЗаключения", "Видимость", ВидимостьВспомогательныхРеквизитов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГодОкончания", 	"Видимость", ВидимостьВспомогательныхРеквизитов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГосЗаказчик", 	"Видимость", ВидимостьВспомогательныхРеквизитов);
	
КонецПроцедуры

#КонецОбласти
